{
    "name": "Sorcerer",
    "hit_dice": "d6",
    "asi_levels": [4, 8, 12, 16, 19],
    "spellcasting": {
        "ability": "CHA",
        "ritual_casting": false,
        "cantrips_known": [4, 4, 4, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6],
        "spells_known":   [2, 3, 4, 5, 6, 7, 8, 9,10,11,12,12,13,13,14,14,15,15,15,15],
        "level1_slots":   [2, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4],
        "level2_slots":   [0, 0, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3],
        "level3_slots":   [0, 0, 0, 0, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3],
        "level4_slots":   [0, 0, 0, 0, 0, 0, 1, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3],
        "level5_slots":   [0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3],
        "level6_slots":   [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2],
        "level7_slots":   [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 2],
        "level8_slots":   [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1],
        "level9_slots":   [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1]
    },
    "features": {
        "Sorcerer Base": {
            "description": "Hit Dice: 1d6 per sorcerer level\n\nProficiencies\nArmor: None\nWeapons: Daggers, darts, slings, quarterstaffs, light crossbows\nTools: None\nSaving Throws: Constitution, Charisma\nSkills: Choose two from Arcana, Deception, Insight, Intimidation, Persuasion, and Religion",
            "weapon_proficiencies": ["dagger", "dart", "sling", "quarterstaff", "light crossbow"],
            "savingthrow_proficiencies": ["CON", "CHA"],
            "choose": {
                "skill_proficiencies": {
                    "amount": 2,
                    "choices": ["arcana", "deception", "insight", "intimidation", "persuasion", "religion"]
                }
            }
        },
        "Sorcerous Origin": {
            "description": "Choose a sorcerous origin, which describes the source of your innate magical power.\n\nYour choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level.",
            "subclass": true
        },
        "Font of Magic": {
            "description": "At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects.\n\nSorcery Points\nYou have am amount of sorcery points equal to your sorcerer level. You can never have more sorcery points than that. You regain all spent sorcery points when you finish a long rest.\n\nFlexible Casting\nYou can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels.\n\nCreating Spell Slots. You can transform unexpended sorcery points into one spell slot as a bonus action on your turn. The Creating Spell Slots table shows the cost of creating a spell slot of a given level. You can create spell slots no higher in level than 5th.\n\nAny spell slot you create with this feature vanishes when you finish a long rest.\n\nCreating Spell Slots\nSpell Slot Level|Sorcery Point Cost\n1st|2\n2nd|3\n3rd|5\n4th|6\n5th|7\n\nConverting a Spell Slot to Sorcery Points. As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot's level.",
            "activation": "CLASS_LEVEL >= 2",
            "bonus_actions": {
                "Creating Spell Slots": "You transform unexpended sorcery points into one spell slot. A 1st level slot costs 2 points, 2nd level slot costs 3 points, 3rd level slot costs 5 points, 4th level slot consts 6 points, 5th level slot cost 7 points, and you cannot create spell slots of higher levels.",
                "Converting a Spell Slot to Sorcery Points": "You can expend one spell slot and gain a number of sorcery points equal to the slot's level."
            }
        },
        "Metamagic": {
            "description": "At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level.\n\nYou can use only one Metamagic option on a spell when you cast it, unless otherwise noted.\n\nCareful Spell\nWhen you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell.\n\nDistant Spell\nWhen you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell.\nWhen you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet.\n\nEmpowered Spell\nWhen you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls.\nYou can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell.\n\nExtended Spell\nWhen you cast a spell that has a duration of 1 minute or longer, you can spend 1 sorcery point to double its duration, to a maximum duration of 24 hours.\n\nHeightened Spell\nWhen you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell.\n\nQuickened Spell\nWhen you cast a spell that has a casting time of 1 action, you can spend 2 sorcery points to change the casting time to 1 bonus action for this casting.\n\nSubtle Spell\nWhen you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components.\n\nTwinned Spell\nWhen you cast a spell that targets only one creature and doesn't have a range of self, you can spend a number of sorcery points equal to the spell's level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip).\nTo be eligible, a spell must be incapable of targeting more than one creature at the spell's current level. For example, magic missile and scorching ray aren't eligible, but ray of frost and chromatic orb are.",
            "activation": "CLASS_LEVEL >= 3"
        },
        "Sorcerous Restoration": {
            "description": "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest.",
            "activation": "CLASS_LEVEL >= 20"
        }
    }
}