{
    "name": "Dragonborn",
    "description": "Dragon-like humanoids with scales, known for their breath weapon and strong ties to draconic heritage",
    "has_subraces": false,
    "features": {
        "Ability Score Increase (Dragonborn)": {
            "description": "Your Strength score increases by 2, and your Charisma score increases by 1.",
            "effects": [
                "STR normal add 2", "CHA normal add 1"
            ]
        },
        "Age of a Dragonborn": {
            "description": "Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80."
        },
        "Size of a Dragonborn": {
            "description": "Dragonborn are taller and heavier than humans, standing well over 180cm tall and averaging almost 112.5kg. Your size is Medium."
        },
        "Speed of a Dragonborn": {
            "description": "Your base walking speed is 9m.",
            "effects": [
                "SPEED earliest max 9"
            ]
        },
        "Draconic Ancestry": {
            "description": "You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table below. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table below.\n\nDragon|Damage Type|Breath Weapon\nBlack|Acid|5 by 9m line (Dexterity save)\nBlue|Lightning|5 by 9m line (Dexterity save)\nBrass|Fire|5 by 9m line (Dexterity save)\nBronze|Lightning|5 by 9m line (Dexterity save)\nCopper|Acid|5 by 9m line (Dexterity save)\nGold|Fire|4.5m cone (Dexterity save)\nGreen|Poison|4.5m cone (Constitution save)\nRed|Fire|4.5m cone (Dexterity save)\nSilver|Cold|4.5m cone (Constitution save)\nWhite|Cold|4.5m cone (Constitution save)"
        },
        "Breath Weapon": {
            "description": "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.\n\nWhen you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.\n\nAfter you use your breath weapon, you can't use it again until you complete a short or long rest.",
            "actions": {
                "Breath Weapon": "Each creature in the are of the exhalation must a saving throw against DC 8 + CON + PB. On a fail it takes 2d6 damage and half as much damage on a success. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level."
            }
        },
        "Damage Resistance": {
            "description": "You have resistance to the damage type associated with your draconic ancestry."
        },
        "Languages of a Dragonborn": {
            "description": "You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants.",
            "languages": ["Common", "Draconic"]
        }
    }
}