{
    "name": "Elf",
    "description": "Graceful and long-lived humanoids, with keen senses, mastery of magic, and an affinity for nature",
    "has_subraces": true,
    "features": {
        "Ability Score Increase (Elf)": {
            "description": "Your Dexterity score increases by 2.",
            "stat_changes": [
                "DEX normal add 2"
            ]
        },
        "Age of an Elf": {
            "description": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old."
        },
        "Size of an Elf": {
            "description": "Elves range from under 150cm to over 180cm tall and have slender builds. Your size is Medium."
        },
        "Speed of an Elf": {
            "description": "Your base walking speed is 9m.",
            "stat_changes": [
                "SPEED earliest max 9"
            ]
        },
        "Darkvision of an Elf": {
            "description": "Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
            "senses": [
                "Darkvision"
            ]
        },
        "Keen Senses": {
            "description": "You have proficiency in the Perception skill.",
            "skill_proficiencies": ["perception"]
        },
        "Fey Ancestry (Elf)": {
            "description": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
        },
        "Trance": {
            "description": "Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
        },
        "Languages of an Elf": {
            "description": "You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires.",
            "languages": [
                "Common", "Elvish"
            ]
        }
    }
}