{
    "name": "Circle of the Land",
    "class": "Druid",
    "description": "Druids who focus on harnessing the power of a specific natural environment, gaining enhanced spellcasting and attunement to the land.",
    "features": {
        "Bonus Cantrip (Circle of the Land)": {
            "description": "When you choose this circle at 2nd level, you learn one additional druid cantrip of your choice. This cantrip doesn't count against the number of druid cantrips you know.",
            "activation": "CLASS_LEVEL >= 2",
            "choose": {
                "cantrips_free": {
                    "amount": 1,
                    "group": "Druid cantrips"
                }
            }
        },
        "Natural Recovery": {
            "description": "Starting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can't use this feature again until you finish a long rest.\n\nFor example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots.",
            "activation": "CLASS_LEVEL >= 2"
        },
        "Circle Spells": {
            "description": "Your mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid. Choose that land — arctic, coast, desert, forest, grassland, mountain, swamp, or Underdark — and consult the associated list of spells.\n\nOnce you gain access to a circle spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you.\n\nArctic\nDruid Level|Spells\n3rd|hold person, spike growth\n5th|sleet storm, slow\n7th|freedom of movement, ice storm\n9th|commune with nature, cone of cold\n\nCoast\nDruid Level|Spells\n3rd|mirror image, misty step\n5th|water breathing, water walk\n7th|control water, freedom of movement\n9th|conjure elemental, scrying\n\nDesert\nDruid Level|Spells\n3rd|blur, silence\n5th|create food and water, protection from energy\n7th|blight, hallucinatory terrain\n9th|insect plague, wall of stone\n\nForest\nDruid Level|Spells\n3rd|barkskin, spider climb\n5th|call lightning, plant growth\n7th|divination, freedom of movement\n9th|commune with nature, tree stride\n\nGrassland\nDruid Level|Spells\n3rd|invisibility, pass without trace\n5th|daylight, haste\n7th|divination, freedom of movement\n9th|dream, insect plague\n\nMountain\nDruid Level|Spells\n3rd|spider climb, spike growth\n5th|lightning bolt, meld into stone\n7th|stone shape, stoneskin\n9th|passwall, wall of stone\n\nSwamp\nDruid Level|Spells\n3rd|darkness, Melf's acid arrow\n5th|water walk, stinking cloud\n7th|freedom of movement, locate creature\n9th|insect plague, scrying\n\nUnderdark\nDruid Level|Spells\n3rd|spider climb, web\n5th|gaseous form, stinking cloud\n7th|greater invisibility, stone shape\n9th|cloudkill, insect plague"
        },
        "Land's Stride": {
            "description": "Starting at 6th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n\nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the Entangle spell.",
            "activation": "CLASS_LEVEL >= 6"
        },
        "Nature's Ward": {
            "description": "When you reach 10th level, you can't be charmed or frightened by elementals or fey, and you are immune to poison and disease.",
            "activation": "CLASS_LEVEL >= 10",
            "damage_immunities": ["poison"],
            "condition_immunitites": ["poisoned"]
        },
        "Nature's Sanctuary": {
            "description": "When you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours.\n\nThe creature is aware of this effect before it makes its attack against you.",
            "activation": "CLASS_LEVEL >= 14"
        }
    }
}