{
    "name": "Life Domain",
    "class": "Cleric",
    "description": "Clerics devoted to preserving life and healing, wielding restorative magic and providing support to allies in battle.",
    "features": {
        "Life Domain Spells": {
            "description": "Cleric Level|Spells\n1st|Bless, Cure Wounds\n3rd|Lesser Restoration, Spiritual Weapon\n5th|Beacon of Hope, Revivify\n7th|Death Ward, Guardian of Faith\n9th|Mass Cure Wounds, Raise Dead",
            "spells_always_prepared": ["Lesser Restoration", "Spiritual Weapon", "Beacon of Hope", "Revivify", "Death Ward", "Guardian of Faith", "Mass Cure Wounds", "Raise Dead"]
        },
        "Bonus Proficiency (Life Domain)": {
            "description": "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
            "armor_proficiencies": ["heavy armor"]
        },
        "Disciple of Life": {
            "description": "Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level."
        },
        "Channel Divinity: Preserve Life": {
            "description": "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.\n\nAs an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 9m of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct.",
            "level": 2,
            "actions": {
                "Channel Divinity: Preserve Life": "You evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 9m of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum."
            }
        },
        "Blessed Healer": {
            "description": "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level.",
            "level": 6
        },
        "Divine Strike": {
            "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "level": 8
        },
        "Supreme Healing": {
            "description": "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
            "level": 17
        }
    }
}