{
    "name": "Oath of Devotion",
    "class": "Paladin",
    "features": {
        "Oath of Devotion Spells": {
            "description": "Paladin Level|Spells\n3rd|Protection from Evil and Good, Sanctuary\n5th|Lesser Restoration, Zone of Truth\n9th|Beacon of Hope, Dispel Magic\n13th|Freedom of Movement, Guardian of Faith\n17th|Commune, Flame Strike",
            "spells_always_prepared": ["Protection from Evil and Good", "Sanctuary", "Lesser Restoration", "Zone of Truth", "Beacon of Hope", "Dispel Magic", "Freedom of Movement", "Guardian of Faith", "Commune", "Flame Strike"]
        },
        "Channel Divinity (Paladin)": {
            "description": "When you take this oath at 3rd level, you gain the following two Channel Divinity options: Sacred Weapon and Turn the Unholy",
            "activation": "CLASS_LEVEL >= 3"
        },
        "Channel Divinity: Sacred Weapon": {
            "description": "As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration.\n\nYou can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, this effect ends.",
            "activation": "CLASS_LEVEL >= 3",
            "actions": {
                "Channel Divinity: Sacred Weapon": "You imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration."
            }
        },
        "Channel Divinity: Turn the Unholy": {
            "description": "As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.",
            "activation": "CLASS_LEVEL >= 3",
            "actions": {
                "Channel Divinity: Turn the Unholy": "Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage. A turned creature must spend its turns trying to move as far away from you as it can."
            }
        },
        "Aura of Devotion": {
            "description": "Starting at 7th level, you and friendly creatures within 10 feet of you can't be charmed while you are conscious.\n\nAt 18th level, the range of this aura increases to 30 feet.",
            "activation": "CLASS_LEVEL >= 7",
            "condition_immunities": ["charmed"]
        },
        "Purity of Spirit": {
            "description": "Beginning at 15th level, you are always under the effects of a Protection from Evil and Good spell.",
            "activation": "CLASS_LEVEL >= 15"
        },
        "Holy Nimbus": {
            "description": "At 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that.\n\nWhenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage.\n\nIn addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead.\n\nOnce you use this feature, you can't use it again until you finish a long rest.",
            "activation": "CLASS_LEVEL >= 20",
            "actions": {
                "Holy Nimbus": "For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that. Whenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage. In addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead."
            }
        }
    }
}